#include <stdio.h>

int main()
{
    int a = 5;
    int b = -5;
    int c;

    c = a << 2;//a >>= 2;// a = a >> 2;
    printf("<< c: %d\n", c);

    c = b << 2;
    printf("<< c: %d\n", c);
    
    c = a >> 2;
    //5 
    //28个0 0101：人的角度原码
    //0 27个0 0101：补码存内存
    //>> 2
    //00 26个0 0001：1
    printf(">> c: %d\n", c);

    c = b >> 2;
    //-5
    //1 27个0 0101：人的角度原码
    //1 27个1 1011：补码
    //>> 2
    //11 26个1 1110：补码
    //1 27个0 0010：原码 -2
    printf(">> c: %d\n", c);

    return 0;
}
