#include <stdio.h>

int main()
{
    //signed char a;[-128, 127]
    //char a = -128;

    //1000 0001 : 129
    //1 1000 0001 : -129 人的角度原码
    //1 0111 1110 : 反码
    //1 0111 1111 : 补码

    //0111 1111 : 补码存内存
    //24个0 0111 1111 : 扩展为32位（signed int）补码
    //0 23个0 0111 1111 : 补码
    //0 23个0 0111 1111 : 原码 -- 127
    char a = -129;
    
    //char b = 127;

    //0 1000 0000 : 128 人的角度原码
    //0 1000 0000 : 补码

    //1000 0000 : 补码存内存
    //24个1 1000 0000 : 扩展为32位（补码）
    //1 23个1 1000 0000 : 补码
    //1 23个0 0111 1111 : 反码
    //1 23个0 1000 0000 : 原码 -- -128
    char b = 128;

    printf("a: %d, b: %d\n", a, b);//%d: signed int: 32Bit
    printf("a: %u, b: %u\n", a, b);//%d: unsigned int: 32Bit

    return 0;
}
