#include <stdio.h>

int main()
{
    int a[] = {1, 2, 3, 4};
    int *p;
    int i;

    p = a;

    printf("(&a[0])[1]: %d\n", (&a[0])[1]);
    printf("(&a[1] - 1)[1]: %d\n", (&a[1] - 1)[1]);
    printf("*((&a[1] - 1) + 1): %d\n", *((&a[1] - 1) + 1));
    printf("*((&(*(a + 1)) - 1) + 1): %d\n", *((&(*(a + 1)) - 1) + 1));

    for(i = 0; i < 4; i ++)
    {
        //[] <=> *()
        //printf("%d ", a[i]);
        //printf("%d ", *(a + i));
        //printf("%d ", p[i]);
        //printf("%d ", *(p + i));

        //结合
        //p ++;
        //*p;
            
        //运算
        //*p;   
        //p = p + 1;
        printf("%d ", *p ++);
        
        //运算
        //*a;
        //a ++; a = a + 1; 地址常量不能赋值
        //a = (int [4])2;
        //a = (int *)2;
        //printf("%d ", *a ++);
    }

    putchar('\n');
    
    //总结：
    //1. [] <=> *()
    //2. []的前面是一个地址
    //3. 数组的下标是偏移量
    //4. 地址常量不能赋值
    //5. *p ++: *p; p = p + 1;

    return 0;
}
